In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from io import StringIO

In [2]:
csv_data = '''
A,B,C,D
1.0,2.0,3.0,4.0
5.0,6.0,,8.0
1.0,11.0,12.0,
'''
df =pd.read_csv(StringIO(csv_data))

In [3]:
df.head()

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   NaN  8.0
2  1.0  11.0  12.0  NaN

In [4]:
df.isnull().sum()

A    0
B    0
C    1
D    1
dtype: int64

In [6]:
#convert pd datafarame to numpy array, which is more convinent for scikitlearn 
df.values

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6., nan,  8.],
       [ 1., 11., 12., nan]])

In [7]:
df.dropna(axis=0)

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [19]:
df_drop =df.dropna(axis=1)

In [20]:
df

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   NaN  8.0
2  1.0  11.0  12.0  NaN

In [21]:
df_drop

     A     B
0  1.0   2.0
1  5.0   6.0
2  1.0  11.0

In [5]:
#mean impute
df.fillna(df.mean())

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   7.5  8.0
2  1.0  11.0  12.0  6.0

In [8]:
df['C'].fillna(df['C'].mean(),inplace=True)

/var/folders/7b/pb4y2ycs0s5fhd1y7ddbk2500000gn/T/ipykernel_1578/2998786113.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['C'].fillna(df['C'].mean(),inplace=True)

In [9]:
df

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   7.5  8.0
2  1.0  11.0  12.0  NaN

In [27]:
data = {
    'Department': ['IT', 'IT', 'HR', 'HR', 'IT', 'HR', 'IT', 'HR'],
    'Salary': [50000, 60000, 45000, np.nan, np.nan, 55000, 65000, np.nan],
    'Absent':['N','N','Y',np.nan,np.nan,'N','N','Y']
}
df_1 = pd.DataFrame(data)

In [28]:
df_1.head()

  Department   Salary Absent
0         IT  50000.0      N
1         IT  60000.0      N
2         HR  45000.0      Y
3         HR      NaN    NaN
4         IT      NaN    NaN

In [29]:
df_1['Salary'].fillna(df_1.groupby('Department')['Salary'].transform('mean').round(2),inplace=True)

/var/folders/7b/pb4y2ycs0s5fhd1y7ddbk2500000gn/T/ipykernel_1578/2754502792.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_1['Salary'].fillna(df_1.groupby('Department')['Salary'].transform('mean').round(2),inplace=True)

In [30]:
df_1

  Department    Salary Absent
0         IT  50000.00      N
1         IT  60000.00      N
2         HR  45000.00      Y
3         HR  50000.00    NaN
4         IT  58333.33    NaN
5         HR  55000.00      N
6         IT  65000.00      N
7         HR  50000.00      Y

In [38]:
df_1['Absent']=df_1['Absent'].fillna(df_1['Absent'].mode()[0])

In [39]:
df_1

  Department    Salary Absent
0         IT  50000.00      N
1         IT  60000.00      N
2         HR  45000.00      Y
3         HR  50000.00      N
4         IT  58333.33      N
5         HR  55000.00      N
6         IT  65000.00      N
7         HR  50000.00      Y

In [41]:
df_1['Absent'].mode()

0    N
Name: Absent, dtype: object

In [11]:
df_cat =pd.DataFrame([['green', 'M', 10.1, 'class2'],
['red', 'L', 13.5, 'class1'],
['blue', 'XL', 15.3, 'class2']])
df_cat.columns=['color', 'size', 'price', 'classlabel']

In [12]:
df_cat

   color size  price classlabel
0  green    M   10.1     class2
1    red    L   13.5     class1
2   blue   XL   15.3     class2

In [13]:
encode ={'M':1,'L':2,'XL':3}
df_cat['size']=df_cat['size'].map(encode)

In [14]:
df_cat

   color  size  price classlabel
0  green     1   10.1     class2
1    red     2   13.5     class1
2   blue     3   15.3     class2

In [15]:
decode = {v:k for k,v in encode.items()}
df_cat['size']=df_cat['size'].map(decode)
df_cat

   color size  price classlabel
0  green    M   10.1     class2
1    red    L   13.5     class1
2   blue   XL   15.3     class2

In [10]:
decode

{1: 'M', 2: 'L', 3: 'XL'}

In [18]:
{v:k for k,v in enumerate(np.unique(df_cat['classlabel']))}

{'class1': 0, 'class2': 1}

In [23]:
from sklearn.preprocessing import LabelEncoder
label_en =LabelEncoder()
label_en.fit(df_cat.classlabel)

ModuleNotFoundError: No module named 'sklearn'

Collecting sklearn
  Downloading sklearn-0.0.post12.tar.gz (2.6 kB)
  Installing build dependencies ... done
  Getting requirements to build wheel ... error
  error: subprocess-exited-with-error

  × Getting requirements to build wheel did not run successfully.
  │ exit code: 1
  ╰─> [15 lines of output]
      The 'sklearn' PyPI package is deprecated, use 'scikit-learn'
      rather than 'sklearn' for pip commands.

      Here is how to fix this error in the main use cases:
      - use 'pip install scikit-learn' rather than 'pip install sklearn'
      - replace 'sklearn' by 'scikit-learn' in your pip requirements files
        (requirements.txt, setup.py, setup.cfg, Pipfile, etc ...)
      - if the 'sklearn' package is used by one of your dependencies,
        it would be great if you take some time to track which package uses
        'sklearn' instead of 'scikit-learn' and report it to their issue tracker
      - as a last resort, set the environment variable
        SKLEARN_ALLOW_DEPRECATED_SKLEARN_PACKAGE_INSTALL=True to avoid this error

      More information is available at
      https://github.com/scikit-learn/sklearn-pypi-package
      [end of output]

  note: This error originates from a subprocess, and is likely not a problem with pip.

[notice] A new release of pip is available: 25.3 -> 26.0.1
[notice] To update, run: pip install --upgrade pip
ERROR: Failed to build 'sklearn' when getting requirements to build wheel
Note: you may need to restart the kernel to use updated packages.